app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @account = Account.find params[:id]

INSERT INTO "accounts" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "yes"], ["user_id", 14], ["created_at", "2020-02-27 05:03:09.618126"], ["updated_at", "2020-02-27 05:03:09.618126"]]
---
  def create
    newAccount = Account.create name: params[:name], description: params[:description], user_id: current_user.id