app/controllers/transactions_controller.rb

  def create
    transaction = Transaction.create text: params[:text], amount: params[:amount], account_id: params[:account_id]
---
INSERT INTO "transactions" ("text", "amount", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "income"], ["amount", 1000], ["account_id", 9], ["created_at", "2020-02-27 00:26:32.800489"], ["updated_at", "2020-02-27 00:26:32.800489"]]