app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    # @user = User.create user_params

    # newUser = User.create user_params

    newUser = User.create email: params[:email], name: params[:name], password: params[:password], password_confirmation: params[:password_confirmation]